# Требуется вычислить, сколько раз встречается некоторое число X в массиве A[1..N]. 
# Пользователь в первой строке вводит натуральное число N – количество элементов в массиве. 
# В последующих  строках записаны N целых чисел Ai. Последняя строка содержит число X
# *Пример:*
# 5
#     1 2 3 4 5
#     3
#     -> 1

import random

n = int(input('Введите длину массива n: '))
arr = [random.randint(1, 101) for i in range(n)]
print(arr)
x = int(input('Введите натуральное число x: '))
print(arr.count(x))  # метод ведущий подсчет
